Repository: jmichault/jekyll-plurlingva-dok
Catalog: _locale/*/012-krei_2_github_pages.md.backup.po
Languages: eo

source: fr
eo: eo

source: fonto
eo: auto

source: créez 1 sous-site _"github page"_
eo: kreu 1 sub-ejon _"github page"_

source: Connectez-vous sur github avec votre identifiant.
eo: Ensalutu al GitHub kun via salutnomo.

source: Allez sur le site de [ _jekyll-plurlingva_ ](https://github.com/jmichault/jekyll-plurlingva), et cliquez sur _«Use this template»_.
eo: Iru al la loko de [ _jekyll-plurlingva_ ](https://github.com/jmichault/jekyll-plurlingva), kaj alklaku _«Use this template»_.

source: Entrez un nom de dépot, et validez la création du dépot. Allez dans les paramètres de votre dépot, descendez jusqu'au paragraphe _«Github Pages»_, et remplacez _«None»_ par _«master»_, cliquez sur _«Save»_.
eo: Enmetu nomon de deponejo, kaj validigu la kreadon de la deponejo. Iru al la agordoj de via deponejo, iru al paragrafo _«Github Pages»_, kaj anstataŭigu _«None»_ kun _«master»_, alklaku _«Save»_.

source: Maintenant connectez vous sur un ordinateur sous linux.
eo: Nun konekti al komputilo en Linukso.

source: Installez les pré-requis : ruby-bundler ruby-dev gawk po4a>=0.61
eo: Instalu la antaŭkondiĉojn: Ruby-Bundler Ruby-Dev Gawk Po4A>= 0.61

source: Par exemple si vous êtes sous debian buster:
eo: Ekzemple se vi estas sub Debian Buster:

source: et récupérez une copie de votre dépot :
eo: kaj retrovu kopion de via magazeno:

source: Choisissez votre langue de travail (code de deux lettres), un titre et une description brève, et initialisez le site :
eo: Elektu vian laboran lingvon (kodo de du literoj), mallonga titolo kaj priskribo, kaj pravalorizi la retejon:

source: Changez le paramètre baseurl dans le fichier _\_config.yml_ , il faut mettre le nom du site au lieu de "", pour avoir ceci :
eo: Ŝanĝu la parametron de Basiurl en la dosiero _\_config.yml_ , la retejo nomo anstataŭ "", por havi ĉi tion:

source: (remplacez _«name»_ par le nom que vous avez choisi)
eo: (Anstataŭigu _«name»_ kun la nomo, kiun vi elektis)

source: (Profitez-en pour changer aussi le nom de l'auteur.)
eo: (profitu ĝin por ŝanĝi la nomon de la aŭtoro.)

source: Si vous voulez moins de langues que les 15 prédéfinies, éditez le fichier _\_data/languages.yml_ et enlevez les lignes correspondantes :
eo: Se vi volas malpli da lingvoj ol la antaŭdifinita 15, redaktu la dosieron _\_data/languages.yml_ kaj forigu la respondajn liniojn:

source: Transmettez les modifications vers votre site _github_ :
eo: Transdoni ŝanĝojn al via retejo _github_ :

source: Félicitations, votre site est créé, il est accessible à l'adresse https://username.github.io/name .
eo: Gratulojn, via retejo estas kreita, ĝi estas alirebla ĉe https://username.github.io/name.
