Repository: jmichault/jekyll-plurlingva-dok
Catalog: _locale/*/033-ebligi-komentojn.md.po
Languages: eo

source: fr
eo: eo

source: fonto
eo: auto

source: Activer les commentaires
eo: Aktivigi komentojn

source: Pour permettre à vos visiteurs d'ajouter des commentaires sur l'une de vos pages, il vous faut :
eo: Por permesi al viaj vizitantoj aldoni komentojn pri unu el viaj paĝoj, vi bezonas:

source: Au niveau du site
eo: Ĉe la retejo

source: pour un site _github page_ : renseigner _gh\_uzanto_ dans _\_config.yml_ avec votre nom d'utilisateur github.
eo: por _github page_ retejo: Plenigu _gh\_uzanto_ en _\_config.yml_ kun via GitHub-salutnomo.

source: pour un sous-site _github page_ : renseigner _gh\_uzanto_ dans _\_config.yml_ avec votre nom d'utilisateur github suivi du sous-site, par exemple «utilisateur/mon site».
eo: por _github page_ subretejo : Plenigu _gh\_uzanto_ en _\_config.yml_ kun via GitHub-salutnomo sekvata de la subretejo, ekzemple "uzanto/mia retejo".

source: Pour le post ou la page
eo: Por la afiŝo aŭ paĝo

source: créer une _«issue»_ dans le dépôt correspondant au site, noter son numéro.
eo: krei _«issue»_ en la deponejo responda al la retejo, rimarku ĝian numeron.

source: ajouter dans l'en-tête _YAML_ du post ou de la page :
eo: aldonu en _YAML_ kaplinion de afiŝo aŭ paĝo :

source: (remplacez _#_ par le numéro noté précédemment)
eo: (Anstataŭigu _#_ kun la numero rimarkata antaŭe)
